"""
药材预热模型参数配置
"""

# =========================
# 1. 几何参数 Geometry
# =========================

# 药材半径 (m)
R = 0.02

# 药材高度 (m)
L = 0.25

# 径向控制体数量
N = 20

# 空间步长 Δr (m)
dr = R / N



# =========================
# 2. 时间参数 Time
# =========================

# 总模拟时间 (s)
t_end =1800

# 时间步长 Δt (s)
dt = 1

# 时间节点数量
Nt = int(t_end / dt)



# =========================
# 3. 药材热物性参数
# =========================

# 密度 ρ (kg/m^3)
rho = 820

# 比热容 cp (J/(kg*K))
cp = 2600

# 热导率 k (W/(m*K))
k = 0.36



# =========================
# 4. 水分扩散参数
# =========================

# 水分扩散系数 D (m^2/s)




# =========================
# 5. 边界传递参数
# =========================

# 对流换热系数 h (W/(m^2*K))
h = 25

# 水分传递系数 hm (m/s)
hm =8e-7



# =========================
# 6. 初始条件
# =========================

# 药材初始温度 (℃)



# 药材初始水分浓度 (kg/kg)
